# GetHostIds Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WallSweep..::..GetHostIds Method
WallSweep Class See Also
---
Gets a list of all host walls on which the sweep resides.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public IList<ElementId> GetHostIds()
```

Visual Basic
---
```text
Public Function GetHostIds As IList(Of ElementId)
```

Visual C++
---
```text
public:
IList<ElementId^>^ GetHostIds()
```

# ### Return Value
The list of wall ids.
# Remarks
Fixed wall sweeps from vertically compound structures will return only one host element.
# See Also
WallSweep Class
Autodesk.Revit.DB Namespace